---
type: TriangulatedSolidOrShell
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# TriangulatedSolidOrShell

`Autodesk.Revit.DB.TriangulatedSolidOrShell` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetShellComponent | 2013 | `public TriangulatedShellComponent GetShellComponent ( int componentIndex )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShellComponentCount | 2013 | `public int ShellComponentCount { get ; }` |